**** Unpacking the APK
We have apk by itself
#+BEGIN_SRC sh
ls
#+END_SRC

#+RESULTS:
| app-release.apk |
| output.json     |


#+BEGIN_SRC sh
apktool d -r app-release.apk -o app >/dev/null # Avoid output
cd app && ls
#+END_SRC

#+RESULTS:
| AndroidManifest.xml |
| apktool.yml         |
| original            |
| res                 |
| resources.arsc      |
| smali               |

Packages can be accessed just like normal except it's buried in the *smali* directory.

Example: =com.hello.world= is =com/hello/world/= in a normal directory but is now =smali/com/hello/world/=.
**** Taking a peek at smali directory
#+BEGIN_SRC sh
ls smali
#+END_SRC

#+RESULTS:
| android |
| com     |

See only things we care about
#+BEGIN_SRC sh
ls smali/com/pygopar/dev831/
#+END_SRC

#+RESULTS:
| BuildConfig.smali    |
| MainActivity$1.smali |
| MainActivity.smali   |
| R$anim.smali         |
| R$attr.smali         |
| R$bool.smali         |
| R$color.smali        |
| R$dimen.smali        |
| R$drawable.smali     |
| R$id.smali           |
| R$integer.smali      |
| R$layout.smali       |
| R$mipmap.smali       |
| R$string.smali       |
| R$style.smali        |
| R$styleable.smali    |
| R.smali              |

*** Rebuilding apk
#+BEGIN_SRC sh
apktool b app >/dev/null # Avoid output
ls app/dist
#+END_SRC

#+RESULTS:
: app-release.apk

*** Running APK
# Fill out prompts
#+BEGIN_SRC sh
keytool -genkey -v -keystore my-key.keystore -alias my_alias -keyalg RSA -validity 10000
#+END_SRC

#+BEGIN_SRC sh
jarsigner -verbose -sigalg MD5withRSA -digestalg SHA1 -keystore my-key.keystore app-release.apk my_alias
#+END_SRC

#+BEGIN_SRC sh
adb uninstall com.pygopar.dev831
adb install ./app-release.apk
#+END_SRC

#+RESULTS:
| Success |
| Success |
